#language: ru

@tree

Функционал: Проверка справочника Товары на прикрепление файла картинки

Как Менеджер по продажам я хочу
правильно отгружать товар сравнивая по картинке 
чтобы не совершить ошибку при отгрузке клиенту товаров     

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка на прикрепление файла картинки в справочнике Товары

*Создание новой номенклатуры
	И В командном интерфейсе я выбираю 'Закупки' 'Товары'
	Тогда открылось окно 'Товары'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно 'Товар (создание)'
	И в поле с именем 'Наименование' я ввожу текст 'Бумага'
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
*Проверка добавления картиник к номенклатуре
	Тогда открылось окно 'Бумага (Товар)'
	И В текущем окне я нажимаю кнопку командного интерфейса 'Файлы'
	И я нажимаю на кнопку с именем 'Создать'
	Тогда открылось окно 'Файл (создание)'
	И в поле с именем 'Наименование' я ввожу текст 'Бумага'
	И я выбираю файл 'C:\Users\fedotova.a\Documents\TestAA\Features\Финальное задание\00ab6fb5-1c5e-4d56-8252-43ed0091d0eb-attachment.png'
	И я нажимаю на кнопку с именем 'ВыбратьФайлСДискаИЗаписать'
	И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
	И я жду закрытия окна 'Бумага (Файл)' в течение 30 секунд
	И В текущем окне я нажимаю кнопку командного интерфейса 'Основное'
	И я нажимаю кнопку выбора у поля с именем "ФайлКартинки"
	Тогда открылось окно 'Файлы'
	И в таблице "Список" я перехожу к строке:
		| 'Наименование' |
		| 'Бумага'       |
	И я нажимаю на кнопку с именем 'ФормаВыбрать'
	Тогда открылось окно 'Бумага (Товар) *'
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	
		
		